# -*- coding: utf-8 -*-
"""
Constants
"""

WRONG_CHARS = 'ÑòàðàÿÄîáðàÿÑàéÔàéÊëèôôîðäÑàéìàêÍî÷ü'

BAUDS = ['9600', '19200', '38400', '57600', '115200']

PROTOCOLS_MAP = {'SAE J1850 PWM': '1',
                 'SAE J1850 VPW': '2',
                 'AUTO, ISO 9141-2': '3',
                 'ISO 14230-4 (KWP 5BAUD)': '4',
                 'ISO 14230-4 (KWP FAST)': '5',
                 'ISO 15765-4 (CAN 11/500)': '6',
                 'ISO 15765-4 (CAN 29/500)': '7',
                 'ISO 15765-4 (CAN 11/250)': '8',
                 'ISO 15765-4 (CAN 29/250)': '9',
                 'SAE J1939 (CAN 29/250)': 'A'}
